kristiangoystdal/Audio_Watermark_Generator/STM32_New/Core/Src/main.c
  update_input_string();

  //-----------------------------------------------------------------------------//
  // Prepare bitstream from input string
  //-----------------------------------------------------------------------------//

  make_bitstream_from_string(input_string);

  //-----------------------------------------------------------------------------//
  // Calculate active duration
  //-----------------------------------------------------------------------------//

  calculate_active_duration_ms();

  //-----------------------------------------------------------------------------//
  // Start DAC DMA
  //-----------------------------------------------------------------------------//
  current_bitstream_index = 0;
  current_bit = bitstream[current_bitstream_index];
  next_bit = bitstream[(current_bitstream_index + 1) % BITSTREAM_LENGTH];
  current_sine_period = 0;
  current_sine_index = 0;
  tx_active = true;

  //---------------------------------------------------------------------------//
  // Main loop
  //---------------------------------------------------------------------------//

  /* USER CODE END 2 */

  /* Initialize COM1 port (115200, 8 bits (7-bit data + 1 stop bit), no parity
   */
  BspCOMInit.BaudRate = 115200;
  BspCOMInit.WordLength = COM_WORDLENGTH_8B;
  BspCOMInit.StopBits = COM_STOPBITS_1;
  BspCOMInit.Parity = COM_PARITY_NONE;
  BspCOMInit.HwFlowCtl = COM_HWCONTROL_NONE;
  if (BSP_COM_Init(COM1, &BspCOMInit) != BSP_ERROR_NONE) {
    Error_Handler();
  }

  /* USER CODE BEGIN BSP */

  /* -- Sample board code to send message over COM1 port ---- */
  printf("\033[2J\033[H");
  printf("-------------------------\r\n");
  printf("Hello from VCP!\r\n");

  /* USER CODE END BSP */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */

  __HAL_TIM_SET_COUNTER(&htim2, 0);
  HAL_TIM_Base_Start(&htim2);

  tx_active = true;

  // Restart DAC with the circular buffer
  HAL_DAC_Start_DMA(&hdac1, DAC_CHANNEL_1, (uint32_t *)output_buffer,
                    BUFFER_SIZE, DAC_ALIGN_12B_R);

  HAL_Delay(5);
  printf("CNDTR=%lu ISR=0x%08lx CR=0x%08lx\r\n",
         (unsigned long)DMA1_Channel1->CNDTR, (unsigned long)DMA1->ISR,
         (unsigned long)DAC1->CR);

  uint32_t c0 = __HAL_TIM_GET_COUNTER(&htim2);
  HAL_Delay(10);
  uint32_t c1 = __HAL_TIM_GET_COUNTER(&htim2);
  printf("TIM2 CNT diff=%lu\r\n", (unsigned long)(c1 - c0));

  printf("-------------------------\r\n");
  printf("Input string prepared:\r\n%s\r\n", input_string);
  printf("Bitstream length: %u bits\r\n", BITSTREAM_LENGTH);
  uint32_t ms = (uint32_t)(total_time * 1000.0f);
  printf("Active duration: %lu ms\r\n", (unsigned long)ms);
  printf("Bitstream:\r\n");
  for (int i = 0; i < BITSTREAM_LENGTH; ++i) {
    printf("%u", bitstream[i]);
  }
  printf("\r\n");
  printf("-------------------------\r\n");

  while (1) {

    // 1) sleep until button wakes you
    EnterStopMode();

    printf("Woke up!\r\n");

    // wait for release (active-low button)
    while (HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_1) == GPIO_PIN_RESET) {
    }
    __HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_1);

    // 2) start TX
    TX_Start();

    // 3) run for duration
    calculate_active_duration_ms();
    uint32_t ms = (uint32_t)(total_time * 1000.0f);
    printf("Active duration: %lu ms\r\n", (unsigned long)ms);

    StartActiveWindowMs((uint32_t)(total_time * 1000.0f));
    while (!active_done) {
      __WFI(); // CPU sleeps while DMA+TIM2+DAC run
    }
    active_done = 0;

    // 4) stop TX and loop back to sleep
    TX_Stop();

    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
 * @brief System Clock Configuration
 * @retval None
 */
void SystemClock_Config(void) {
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
   */
  HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1);

  /** Initializes the RCC Oscillators according to the specified parameters
   * in the RCC_OscInitTypeDef structure.
   */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL.PLLM = RCC_PLLM_DIV1;
  RCC_OscInitStruct.PLL.PLLN = 8;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = RCC_PLLQ_DIV2;
  RCC_OscInitStruct.PLL.PLLR = RCC_PLLR_DIV2;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
   */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK |
                                RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK) {
    Error_Handler();
  }
}

/**
 * @brief DAC1 Initialization Function
 * @param None
 * @retval None
 */
static void MX_DAC1_Init(void) {

  /* USER CODE BEGIN DAC1_Init 0 */

  /* USER CODE END DAC1_Init 0 */

  DAC_ChannelConfTypeDef sConfig = {0};

  /* USER CODE BEGIN DAC1_Init 1 */

  /* USER CODE END DAC1_Init 1 */

  /** DAC Initialization
   */
  hdac1.Instance = DAC1;
  if (HAL_DAC_Init(&hdac1) != HAL_OK) {
    Error_Handler();
  }

  /** DAC channel OUT1 config
   */
  sConfig.DAC_HighFrequency = DAC_HIGH_FREQUENCY_INTERFACE_MODE_AUTOMATIC;
  sConfig.DAC_DMADoubleDataMode = DISABLE;
  sConfig.DAC_SignedFormat = DISABLE;
  sConfig.DAC_SampleAndHold = DAC_SAMPLEANDHOLD_DISABLE;
  sConfig.DAC_Trigger = DAC_TRIGGER_T2_TRGO;
  sConfig.DAC_Trigger2 = DAC_TRIGGER_NONE;
  sConfig.DAC_OutputBuffer = DAC_OUTPUTBUFFER_ENABLE;
  sConfig.DAC_ConnectOnChipPeripheral = DAC_CHIPCONNECT_EXTERNAL;
  sConfig.DAC_UserTrimming = DAC_TRIMMING_FACTORY;
  if (HAL_DAC_ConfigChannel(&hdac1, &sConfig, DAC_CHANNEL_1) != HAL_OK) {
    Error_Handler();
  }
  /* USER CODE BEGIN DAC1_Init 2 */

  /* USER CODE END DAC1_Init 2 */
}

/**
 * @brief TIM2 Initialization Function
 * @param None
 * @retval None
 */
static void MX_TIM2_Init(void) {

  /* USER CODE BEGIN TIM2_Init 0 */

