kristiangoystdal/Audio_Watermark_Generator/STM32_New/Core/Src/main.c
  // Fill remaining bits with silence if any
  while (k < BITSTREAM_LENGTH) {
    bitstream[k++] = 2; // silence
  }
}

void update_input_string(void) {
  input_string[0] = '\0';
  size_t offset = 0;
  size_t remaining = MAX_NUM_CHARS;
  int n = 0;

  // Append USER_STRING if enabled
  if (INCLUDE_USER_STRING) {
    n = snprintf(&input_string[offset], remaining, "/STR%s", USER_STRING);
    if (n > 0 && (size_t)n < remaining) {
      offset += (size_t)n;
      remaining -= (size_t)n;
    }
  }
  // Append DEVICE_ID if enabled
  if (INCLUDE_DEVICE_ID) {
    n = snprintf(&input_string[offset], remaining, "%s/DID%d",
                 (offset > 0) ? "" : "", DEVICE_ID);
    if (n > 0 && (size_t)n < remaining) {
      offset += (size_t)n;
      remaining -= (size_t)n;
    }
  }
  // Append LOCATION if enabled
  if (INCLUDE_LOCATION) {
    n = snprintf(&input_string[offset], remaining, "%s/LOC%s",
                 (offset > 0) ? "" : "", LOCATION);
    if (n > 0 && (size_t)n < remaining) {
      offset += (size_t)n;
      remaining -= (size_t)n;
    }
  }
  // Append TEMPERATURE if enabled
  if (INCLUDE_TEMPERATURE) {
    n = snprintf(&input_string[offset], remaining, "%s/TMP%d",
                 (offset > 0) ? "" : "", temp_int);
    if (n > 0 && (size_t)n < remaining) {
      offset += (size_t)n;
      remaining -= (size_t)n;
    }
  }
  // Append TIME if enabled
  if (INCLUDE_TIME) {
    n = snprintf(&input_string[offset], remaining,
                 "%s/TIM%02d%02d%02d%02d%02d%02d%04d", (offset > 0) ? "" : "",
                 now.hours, now.minutes, now.seconds, now.day, now.date,
                 now.month, now.year);

    if (n > 0 && (size_t)n < remaining) {
      offset += (size_t)n;
      remaining -= (size_t)n;
    }
  }
  // Add termination sign
  if (strlen(input_string) > 0) {
    n = snprintf(&input_string[offset], remaining, "/");
    if (n > 0 && (size_t)n < remaining) {
      offset += (size_t)n;
      remaining -= (size_t)n;
    }
  }
}

// Function to generate sine wave lookup table for low frequency
void get_sineval_low(void) {
  for (int i = 0; i < FSK_LOWER_NUM_SAMPLES; i++) {
    sine_val_low[i] =
        (uint16_t)((4095.0 / 2.0) *
                   (1.0 +
                    sinf(2.0 * pi * i / FSK_LOWER_NUM_SAMPLES) * (1.5 / 1.65)));
  }
}

// Function to generate sine wave lookup table for the high frequency
void get_sineval_high(void) {
  for (int i = 0; i < FSK_HIGHER_NUM_SAMPLES; i++) {
    sine_val_high[i] =
        (uint16_t)((4095.0 / 2.0) *
                   (1.0 + sinf(2.0 * pi * i / FSK_HIGHER_NUM_SAMPLES) *
                              (1.5 / 1.65)));
  }
}

void get_dc_mid(void) {
  uint16_t mid_value = (uint16_t)(4095.0 / 2.0);
  for (int i = 0; i < FSK_LOWER_NUM_SAMPLES; i++) {
    dc_mid[i] = mid_value;
  }
}

uint32_t get_dac_sample_rate_hz(void) {
  uint32_t tim_clk = HAL_RCC_GetPCLK1Freq();
  if ((RCC->CFGR & RCC_CFGR_PPRE1) != RCC_CFGR_PPRE1_DIV1)
    tim_clk *= 2; // timer clock doubled if APB prescaler != 1

  return tim_clk / ((htim2.Init.Prescaler + 1) * (htim2.Init.Period + 1));
}

void calculate_active_duration_ms(void) {
  fs = get_dac_sample_rate_hz();

  float f_0 = (float)fs / (float)FSK_LOWER_NUM_SAMPLES;
  float f_1 = (float)fs / (float)FSK_HIGHER_NUM_SAMPLES;

  f_0_bit_duration = (float)FSK_LOWER_PERIODS / f_0;
  f_1_bit_duration = (float)FSK_HIGHER_PERIODS / f_1;

  // Exact bitstream time
  total_time = 0.0f;
  for (int i = 0; i < BITSTREAM_LENGTH; ++i) {
    if (bitstream[i] == 0) {
      total_time += ((float)FSK_LOWER_PERIODS) / f_0;
    } else if (bitstream[i] == 1) {
      total_time += (float)FSK_HIGHER_PERIODS / f_1;
    } else {
      total_time += ((float)FSK_LOWER_PERIODS) / f_0; // silence
    }
  }

  // Add silence time
  total_time *= 1.05f;                            // 5% margin
  total_time += cable_speaker_delay_ms / 1000.0f; // 10ms margin
}

FillResult fill_half_buffer(uint16_t *buffer, uint16_t bit, uint16_t next_bit,
                            size_t generation_size, size_t current_sine_period,
                            size_t current_sine_index) {
  size_t out = 0;
  size_t period = current_sine_period;
  size_t idx = current_sine_index;
  uint16_t cur_bit = bit;
  bool moved = false;

  while (out < generation_size) {

    /* Select LUT */
    const uint16_t *lut;
    size_t lut_len;
    size_t target_periods;

    if (cur_bit == 0) {
      lut = sine_val_low;
      lut_len = FSK_LOWER_NUM_SAMPLES;
      target_periods = FSK_LOWER_PERIODS;
    } else if (cur_bit == 1) {
      lut = sine_val_high;
      lut_len = FSK_HIGHER_NUM_SAMPLES;
      target_periods = FSK_HIGHER_PERIODS;
    } else {
      lut = dc_mid;
      lut_len = FSK_LOWER_NUM_SAMPLES; // constant value
      target_periods = FSK_LOWER_PERIODS;
    }

    /* How many samples can we copy this round? */
    size_t left_buf = generation_size - out;
    size_t left_lut = lut_len - idx;
    size_t n = left_buf < left_lut ? left_buf : left_lut;

    memcpy(&buffer[out], &lut[idx], n * sizeof(uint16_t));

    out += n;
    idx += n;

    /* Wrapped LUT = completed one period */
    if (idx == lut_len) {
      idx = 0;
      period++;

      /* Completed all periods for this bit */
      if (period == target_periods) {
        period = 0;
        cur_bit = next_bit;
        moved = true;
      }
    }
  }

  return (FillResult){.moved_to_next_bit = moved,
                      .current_period = period,
                      .current_index = idx};
}

// DAC conversion complete callbacks for half buffer
void HAL_DAC_ConvHalfCpltCallbackCh1(DAC_HandleTypeDef *hdac) {
  if (!tx_active)
    return;

  // Fill the first half of the buffer based on the current bit
  result = fill_half_buffer((uint16_t *)&output_buffer[0], current_bit,
                            next_bit, BUFFER_SIZE / 2, current_sine_period,
                            current_sine_index);

  moved_to_next_bit = result.moved_to_next_bit;
  current_sine_period = result.current_period;
  current_sine_index = result.current_index;

  if (moved_to_next_bit) {
    moved_to_next_bit = false;
    current_bitstream_index = (current_bitstream_index + 1) % BITSTREAM_LENGTH;
    current_bit = bitstream[current_bitstream_index];
    next_bit = bitstream[(current_bitstream_index + 1) % BITSTREAM_LENGTH];
  }
}

// DAC conversion complete callback for the full buffer
void HAL_DAC_ConvCpltCallbackCh1(DAC_HandleTypeDef *hdac) {
  if (!tx_active)
    return;

