kristiangoystdal/Audio_Watermark_Generator/STM32_New/Core/Src/main.c
  // Fill the first half of the buffer based on the current bit
  result = fill_half_buffer((uint16_t *)&output_buffer[BUFFER_SIZE / 2],
                            current_bit, next_bit, BUFFER_SIZE / 2,
                            current_sine_period, current_sine_index);

  moved_to_next_bit = result.moved_to_next_bit;
  current_sine_period = result.current_period;
  current_sine_index = result.current_index;

  if (moved_to_next_bit) {
    moved_to_next_bit = false;
    current_bitstream_index = (current_bitstream_index + 1) % BITSTREAM_LENGTH;
    current_bit = bitstream[current_bitstream_index];
    next_bit = bitstream[(current_bitstream_index + 1) % BITSTREAM_LENGTH];
  }
}

static void TX_Start(void) {
  printf("TX_Start()\r\n");
  // reset FSK state
  current_bitstream_index = 0;
  current_bit = bitstream[current_bitstream_index];
  next_bit = bitstream[(current_bitstream_index + 1) % BITSTREAM_LENGTH];
  current_sine_period = 0;
  current_sine_index = 0;
  tx_active = true;

  printf("Filling initial buffer...\r\n");
  // IMPORTANT: fill BOTH halves before starting DMA
  FillResult r1 = fill_half_buffer(&output_buffer[0], current_bit, next_bit,
                                   BUFFER_SIZE / 2, current_sine_period,
                                   current_sine_index);
  current_sine_period = r1.current_period;
  current_sine_index = r1.current_index;
  if (r1.moved_to_next_bit) {
    current_bitstream_index = (current_bitstream_index + 1) % BITSTREAM_LENGTH;
    current_bit = bitstream[current_bitstream_index];
    next_bit = bitstream[(current_bitstream_index + 1) % BITSTREAM_LENGTH];
  }

  FillResult r2 = fill_half_buffer(&output_buffer[BUFFER_SIZE / 2], current_bit,
                                   next_bit, BUFFER_SIZE / 2,
                                   current_sine_period, current_sine_index);
  current_sine_period = r2.current_period;
  current_sine_index = r2.current_index;
  if (r2.moved_to_next_bit) {
    current_bitstream_index = (current_bitstream_index + 1) % BITSTREAM_LENGTH;
    current_bit = bitstream[current_bitstream_index];
    next_bit = bitstream[(current_bitstream_index + 1) % BITSTREAM_LENGTH];
  }

  printf("Starting DAC DMA...\r\n");
  // start DAC first, then timer triggers
  HAL_DAC_Start_DMA(&hdac1, DAC_CHANNEL_1, (uint32_t *)output_buffer,
                    BUFFER_SIZE, DAC_ALIGN_12B_R);
  HAL_TIM_Base_Start(&htim2);
}

static void TX_Stop(void) {
  tx_active = false;

  HAL_TIM_Base_Stop(&htim2);
  HAL_DAC_Stop_DMA(&hdac1, DAC_CHANNEL_1);
}

/* USER CODE END 4 */

/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2026 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */

/**
 * @}
 */

/**
 * @}
 */

/**
 * @brief  This function is executed in case of error occurrence.
 * @retval None
 */
void Error_Handler(void) {
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1) {
  }
  /* USER CODE END Error_Handler_Debug */
}
#ifdef USE_FULL_ASSERT
/**
 * @brief  Reports the name of the source file and the source line number
 *         where the assert_param error has occurred.
 * @param  file: pointer to the source file name
 * @param  line: assert_param error line source number
 * @retval None
 */
void assert_failed(uint8_t *file, uint32_t line) {
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line
     number, ex: printf("Wrong parameters value: file %s on line %d\r\n", file,
     line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
